html/20231128T133020--create-a-blog-with-hugo__hugo_websites.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/org-static-blog/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/org-static-blog/html">
<title>create a blog with hugo</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">18 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/org-static-blog/html/20231128T133020--create-a-blog-with-hugo__hugo_websites.html">create a blog with hugo</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org578550d">1. commands</a></li>
</ul>
</div>
</nav>
<p>
get started video - <a href="https://www.youtube.com/watch?v=LIFvgrRxdt4&amp;ab_channel=RyanSchachte">https://www.youtube.com/watch?v=LIFvgrRxdt4&amp;ab_channel=RyanSchachte</a>
</p>

<p>
second video - <a href="https://www.youtube.com/watch?v=hjD9jTi_DQ4&amp;t=2225s&amp;ab_channel=EnvatoTuts%2B">https://www.youtube.com/watch?v=hjD9jTi_DQ4&amp;t=2225s&amp;ab_channel=EnvatoTuts%2B</a>
</p>

<div id="outline-container-org578550d" class="outline-2">
<h2 id="org578550d"><span class="section-number-2">1.</span> commands</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>hugo new site nameofthesite</li>
<li>cd themes git clone theme</li>
<li>change config.toml to config.yml</li>
<li>hugo server - works</li>
<li>hugo new posts/firstpost.md</li>
<li>git submodule add -b master <a href="https://github.com/arvydasg/arvydasg.github.io.git">https://github.com/arvydasg/arvydasg.github.io.git</a>
public (public where file will be stored)</li>
<li>hugo -t hugo-PaperMod</li>
<li>cd public</li>
<li>git remote -v (origin is not what you expected ;) its arvydas.github.io</li>
<li>push public folder and site is live!</li>
</ul>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/org-static-blog/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/org-static-blog/html/tag-hugo.html">hugo</a> <a href="https://arvydasg.github.io/org-static-blog/html/tag-websites.html">websites</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
